Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Because starting a Kafka broker can be long, Dev Services for Kafka uses https://vectorized.io/redpanda[Redpanda], a Kafka compatible broker which starts in ~1 second.
zh_cn: 因为启动Kafka broker的时间可能很长，所以Kafka开发服务使用了 link:https://vectorized.io/redpanda[Redpanda] ，这是一个与Kafka兼容的broker，而且启动时间仅为1秒左右。

source: Because the interaction with the database is non-blocking and asynchronous, we need to use asynchronous constructs to implement our HTTP resource. Quarkus uses Mutiny as its central reactive programming model. So, it supports returning Mutiny types (`Uni` and `Multi`) from HTTP endpoints. Also, our Fruit Panache entity exposes methods using these types, so we only need to implement the _glue_.
zh_cn: 由于与数据库的交互是非阻塞的和异步的，我们需要使用异步构造来实现我们的HTTP资源。Quarkus使用Mutiny作为其核心响应式编程模型。因此，它支持从HTTP端点返回Mutiny类型 (`Uni` and `Multi`) 。此外，水果Panache实例使用这些类型公开方法，因此我们只需要实现 _glue_。

source: Because we are using JUnit 5, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support Junit 5:
zh_cn: 因为我们使用的是JUnit 5，所以必须设置 link:https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven插件] 的版本，因为默认版本不支持Junit 5：

source: Because we want to consume messages from the `quotes-requests` queue into the `requests` channel, we need to configure this association. Open the `src/main/resources/application.properties` file and add:
zh_cn: 因为我们想把 `quotes-requests` 队列中的消息消费到 `requests` 通道中，因此我们需要配置这个关联。请打开 `src/main/resources/application.properties` 文件并添加：

source: Because we write to a database, we must run this method in a transaction. Yet, sending the entity to Kafka happens asynchronously. The operation returns a `CompletionStage` (or a `Uni` if you use a `MutinyEmitter`) reporting when the operation completes. We must be sure that the transaction is still running until the object is written. Otherwise, you may access the object outside the transaction, which is not allowed.
zh_cn: 因为我们要往数据库写入数据，所以我们必须在事务中运行该方法。然而，向Kafka发送消息是异步的。该操作完成后会返回一个 `CompletionStage` (如果您使用 `MutinyEmitter`，则返回 `Uni`)。我们必须确认在对象被写入之前事务仍然在运行。否则，您可能会在事务之外访问到该对象，而这是不允许的。

source: Before going further, be sure to have a working container runtime (Docker, podman) environment. If you use Docker on Windows you should share your project's drive at Docker Desktop file share settings and restart Docker Desktop.
zh_cn: 在进一步行动之前，请确保有一个工作的容器运行环境（Docker或podman）。如果你在Windows上使用Docker，你应该在Docker Desktop文件共享设置中共享你的项目的驱动器，并重新启动Docker Desktop。

source: Before going further, open the `src/main/resource/application.properties` file and add:
zh_cn: 在继续之前，打开 `src/main/resource/application.properties` 文件并添加：

source: Before going further, open the `src/main/resources/application.properties` file and add:
zh_cn: 在进行下一步之前，请打开 `src/main/resource/application.properties` 文件并添加下面这一段内容到该文件：

source: Before launching our Docker build, we need to update the default `.dockerignore` file as it filters everything except the `target` directory. As we plan to build inside a container, we need to copy the `src` directory. Thus, edit your `.dockerignore` and update the content.
zh_cn: 在启动我们的Docker构建之前，我们需要更新默认的 `.dockerignore` 文件，因为它过滤了除 `target` 目录之外的所有内容。由于我们计划在容器内构建，我们需要复制 `src` 目录。因此，编辑你的 `.dockerignore` ，并更新内容。

source: Before running the application, don't forget to stop the hot reload mode (hit `CTRL+C`), or you will have a port conflict.
zh_cn: 在运行应用程序之前，不要忘记停止热重载模式（使用 `CTRL+C` ），否则你会有一个端口冲突。

source: Before you start building security into your Quarkus applications, review the overview information to learn about the Quarkus Security architecture and the different authentication and authorization mechanisms that Quarkus supports.
zh_cn: 在您开始在您的Quarkus应用程序中建立安全机制之前，请回顾一下概述信息，了解Quarkus Security架构以及Quarkus支持的不同认证和授权机制。

source: Being reactive
zh_cn: 响应式

source: Below, you can see how the container images created above can be built and deployed to AWS using the `docker` and `aws` command line tools. These instructions work for both native and jvm container images and assume that the `aws` command line tool has been logged in.
zh_cn: 下面，你可以看到如何使用 `docker` 和 `aws` 命令行工具将上面创建的容器镜像构建并部署到AWS中。这些指令对原生和jvm容器镜像都适用，并假设已经登录到 `aws` 命令行工具。

source: Best of Breed Libraries and Standards
zh_cn: 最好的类库和标准

source: Beyond simply working, we’re aiming for Joy.
zh_cn: 除了工作，我们的目标是充满乐趣。

source: Bi-directional communication with browsers using SockJS
zh_cn: 使用SockJS与浏览器进行双向通信

source: Blocking processing
zh_cn: 阻塞处理

source: Blog
zh_cn: 博客

source: Books
zh_cn: 书籍

source: Boom! Your Quarkus app is now running at <code>localhost:8080</code>
zh_cn: 当当当！您的Quarkus应用已经在<code>localhost:8080</code>运行了

source: Bootstrapping a reactive CRUD application with Quarkus
zh_cn: 使用 Quarkus 引导响应式 CRUD 应用程序

source: Bootstrapping an application
zh_cn: 创建一个应用程序

source: Bootstrapping the Reactive Fruits application
zh_cn: 启动响应式水果应用程序

source: Bootstrapping the application
zh_cn: 引导启动该应用程序

source: Bootstrapping the project
zh_cn: 创建项目

source: Both RESTassured and `@TestHTTPResource` allow you to specify the endpoint class you are testing rather than hard coding a path. This currently supports both JAX-RS endpoints, Servlets and Reactive Routes. This makes it a lot easier to see exactly which endpoints a given test is testing.
zh_cn: RESTassured和 `@TestHTTPResource` 都允许您指定要测试的节点类，而不是对路径硬编码。这目前支持JAX-RS节点、Servlets和Reactive Routes。这使您更容易查看给定的测试用例到底在测试哪些节点。

source: Both `findByNameWithPanacheQLQuery()` and `findByNameWithNativeQuery()` methods will return the same result but query written in PanacheQL will use the entity field name: `name`, and native query will use the MongoDB field name: `lastname`.
zh_cn: `findByNameWithPanacheQLQuery()` 和 `findByNameWithNativeQuery()` 方法都将返回相同的结果，但用PanacheQL编写的查询将使用实体字段名： `name` ，而原生查询将使用MongoDB字段名： `lastname` 。

source: Both configuration properties support glob patterns.
zh_cn: 这两个配置属性都支持glob模式。

source: Both timers and distribution summaries can be configured to emit additional statistics, like histogram data, precomputed percentiles, or service level objective (SLO) boundaries. Note that the count, sum, and histogram data can be re-aggregated across dimensions (or across a series of instances), while precomputed percentile values cannot.
zh_cn: Timers和distritution summaries都可以被配置为发送额外的统计数据，如hitogram数据、预计算的百分位数或service level object（SLO）的边界值。请注意，计数、总和和histogram数据可以跨维度（或跨一系列实例）重新汇总，而预计算的百分数则不能。

source: Broadcasting messages on multiple consumers
zh_cn: 对多个消费者广播信息

source: Browse through these selections of new Quarkus related books and resources to expand your knowledge and hone your coding skills to step up your Quarkus game.
zh_cn: 浏览这些与Quarkus相关的新书籍和资源，扩展您的知识，磨练您的编码技能，从而提升您的Quarkus游戏水平。

source: Build
zh_cn: 构建

source: Build Container Images
zh_cn: 构建容器镜像

source: Build Items
zh_cn: 构建项目

source: Build Time Processing
zh_cn: 构建时处理

source: Build and Deploy
zh_cn: 构建和部署

source: Build fully static native executables
zh_cn: 构建纯静态原生可执行文件

source: Build native executables with GraalVM or Mandrel.
zh_cn: 用GraalVM或Mandrel构建原生可执行文件。

source: Build the Docker image
zh_cn: 构建Docker镜像

source: Build the project:
zh_cn: 构建项目。

source: Build the site and make it available on a local server
zh_cn: 构建站点并使其在本地服务器上可用

source: Build, Sign and Encrypt JSON Web Tokens (JWT)
zh_cn: 建立、签署和加密JSON网络令牌(JWT)

source: Building Applications with Gradle
zh_cn: 用Gradle构建应用程序

source: Building Applications with Maven
zh_cn: 用Maven构建应用程序

source: Building My First Extension
zh_cn: 构建我的第一个扩展

source: Building Native Executables
zh_cn: 构建原生可执行文件

source: Building a Native Executable
zh_cn: 构建一个原生可执行文件

source: Building a native executable
zh_cn: 构建一个本地可执行文件

source: Building a native executable requires using a distribution of GraalVM. There are three distributions: Oracle GraalVM Community Edition (CE), Oracle GraalVM Enterprise Edition (EE) and Mandrel. The differences between the Oracle and Mandrel distributions are as follows:
zh_cn: 构建一个原生可执行文件需要使用GraalVM的发行版。有三个发行版：Oracle GraalVM社区版（CE）、Oracle GraalVM企业版（EE）和Mandrel。Oracle和Mandrel发行版之间的区别如下：

source: Building on the features provided by `InjectMock`, Quarkus also allows users to effortlessly take advantage of link:https://site.mockito.org/[Mockito] for spying on the beans supported by `QuarkusMock`. This functionality is available via the `@io.quarkus.test.junit.mockito.InjectSpy` annotation which is available in the `quarkus-junit5-mockito` dependency.
zh_cn: 基于 `InjectMock` 所提供的功能，Quarkus还允许用户很容易利用 link:https://site.mockito.org/[Mockito] 来对 `QuarkusMock` 所支持的bean进行spy操作。这个功能可以通过 `@io.quarkus.test.junit.mockito.InjectSpy` 注解来实现，该注解通过 `quarkus-junit5-mockito` 依赖导入。

source: Building on the features provided by `QuarkusMock`, Quarkus also allows users to effortlessly take advantage of link:https://site.mockito.org/[Mockito] for mocking the beans supported by `QuarkusMock`. This functionality is available via the `@io.quarkus.test.junit.mockito.InjectMock` annotation which is available in the `quarkus-junit5-mockito` dependency.
zh_cn: 基于 `QuarkusMock` 所提供的功能，Quarkus还允许用户很容易地利用 link:https://site.mockito.org/[Mockito] 来mock `QuarkusMock` 所支持的bean。该功能可以通过 `@io.quarkus.test.junit.mockito.InjectMock` 注解来实现，该注解可以通过添加 `quarkus-junit5-mockito` 依赖而导入。

source: Building with Mandrel requires a custom builder image parameter to be passed additionally:
zh_cn: 使用Mandrel构建需要额外传递一个自定义的构建器镜像参数：

source: Builds and returns a `Map` containing all the properties required to configure the application to use in-memory channels.
zh_cn: 构建并返回一个 `Map` ，包含配置应用程序使用内存 channels 所需的所有属性。

source: Built-In Authentication Support
zh_cn: 内置的认证支持

source: Built-in Quarkus features available in Eclipse Che incl. che.openshift.io.
zh_cn: Eclipse Che内置的Quarkus功能支持，包括che.openshift.io。

source: Built-in Quarkus features available only in IntelliJ IDEA Ultimate
zh_cn: IntelliJ IDEA Ultimate独享的内置Quarkus支持

source: Business Automation
zh_cn: 业务自动化

source: But if you already have all the required `quarkus-oidc` properties configured then you only need to associate `quarkus.oidc.auth-server-url` with the `prod` profile for `Dev Services for Keycloak`to start a container, for example:
zh_cn: 但是如果你已经配置了所需的 `quarkus-oidc` 属性，那么你只需要将 `quarkus.oidc.auth-server-url` 与 `Keycloak开发服务` 的 `prod` 配置文件联系起来，以启动一个容器，例如：

source: But these methods also accept an optional `Sort` parameter, which allows your to abstract your sorting:
zh_cn: 这些方法也可以接收一个 `Sort` 参数，它是对排序的抽象封装：

source: But this type of class comes with some limitations: all fields needs to be initialized at construction time or be marked as nullable, and the generated constructor needs to have as parameters all the fields of the data class.
zh_cn: 但是这种类型的类有一些限制：所有的字段都需要在构造时被初始化或者被标记为nullable（可空），而且生成的构造函数需要有数据类的所有字段作为参数。

source: But you may be wondering where the URL is configured as it’s not in the code. Remember, it must not be hard-coded because the URL likely depends on the environment. The URL is configured in the application configuration:
zh_cn: 但你可能想知道URL是在哪里配置的，因为它不在代码中。记住，它不能是硬编码的，因为URL很可能取决于环境。URL是在应用程序配置中设置的：

source: But, there is a catch. We need a way to write continuation-passing code. There are many ways of doing this. In Quarkus, we propose:
zh_cn: 但是，有一个问题。我们需要一种方法来编写延续传递代码。有很多方法可以做到这一点。在Quarkus，我们提出：

source: But, what about streams? Generating a <em>server-sent event</em> response with Quarkus is just as simple:
zh_cn: 还有，事件流怎么处理？用Quarkus生成一个<em>server-sent 事件</em>响应也同样简单。

source: By default Quarkus automatically detects the container runtime. If you want to explicitely select the container runtime, you can do it with:
zh_cn: 在默认情况下，Quarkus会自动检测容器的运行时。如果你想明确地选择容器的运行时，你可以通过以下方式实现：

source: By default Quarkus will restrict the use of JNDI within an application, as a precaution to try and mitigate any future vulnerabilities similar to log4shell. Because the `mongo+srv` protocol often used to connect to MongoDB requires JNDI, this protection is automatically disabled when using the MongoDB client extension.
zh_cn: 默认情况下，Quarkus会限制在应用程序中使用JNDI，作为一种预防措施，以尝试缓解所有将来类似于 log4shell 的漏洞。因为通常用于连接MongoDB的 `mongo+srv` 协议需要JNDI，所以在使用MongoDB客户端扩展时，这种保护会自动关闭。

source: By default when a Quarkus application starts (in regular or dev mode), it will display an ASCII art banner. The banner can be disabled by setting `quarkus.banner.enabled=false` in `application.properties`, by setting the `-Dquarkus.banner.enabled=false` Java System Property, or by setting the `QUARKUS_BANNER_ENABLED` environment variable to `false`. Furthermore, users can supply a custom banner by placing the banner file in `src/main/resources` and configuring `quarkus.banner.path=name-of-file` in `application.properties`.
zh_cn: 默认情况下，当Quarkus应用程序启动时（在常规或开发模式下），它将显示一个ASCII。通过在 `application.properties` 中设置 `quarkus.banner.enabled=false` ，通过设置 `-Dquarkus.banner.enabled=false` Java系统属性，或者通过将 `QUARKUS_BANNER_ENABLED` 环境变量设置为 `false` ，可以禁用该横幅。此外，用户可以通过将横幅文件放在 `src/main/resources` ，并在 `application.properties` 中配置 `quarkus.banner.path=name-of-file` ，从而提供一个自定义的横幅。

source: By default, Dev Services for AMQP picks a random port and configures the application. You can set the port by configuring the `quarkus.amqp.devservices.port` property.
zh_cn: 默认情况下，AMQP的开发服务会选择一个随机端口，并配置应用程序。您可以通过配置 `quarkus.amqp.devservices.port` 属性来设置端口。

source: By default, Dev Services for Apicurio Registry picks a random port and configures the application. You can set the port by configuring the `quarkus.apicurio-registry.devservices.port` property.
zh_cn: 默认情况下，Apicurio注册表的开发服务会选择一个随机端口，并配置应用程序。你可以通过配置 `quarkus.apicurio-registry.devservices.port` 属性来设置端口。

source: By default, Dev Services for Kafka picks a random port and configures the application. You can set the port by configuring the `quarkus.kafka.devservices.port` property.
zh_cn: 默认情况下，Kafka开发服务会随机挑选一个端口并配置应用程序。您可以通过配置 `quarkus.kafka.devservices.port` 属性来设置端口。

source: By default, Quarkus automatically detects the container runtime. If you want to explicitly select the container runtime, you can do it with:
zh_cn: 默认情况下，Quarkus会自动检测容器的运行时。如果你想显式指定择容器的运行时，你可以通过以下方式实现：

source: By default, Quarkus does proactive authentication, which means that all incoming requests with credentials are authenticated regardless of whether the target page requires authentication. For more information, see xref:security-built-in-authentication.adoc#proactive-authentication[Proactive authentication].
zh_cn: 默认情况下，Quarkus会进行我们所说的主动认证。这意味着所有包含证书的请求将总是被认证，而不论目标页面是否需要认证。更多信息见 link:security-built-in-authentication.html#proactive-authentication[主动认证] 。

source: By default, Quarkus initializes all classes at build time.
zh_cn: 默认情况下，Quarkus在构建时初始化所有类。

source: By default, Quarkus waits for 60 seconds for the native image to start before automatically failing the native tests. This duration can be changed using the `quarkus.test.wait-time` system property. For example, to increase the duration to 300 seconds, use: `./mvnw verify -Pnative -Dquarkus.test.wait-time=300`.
zh_cn: 默认情况下，Quarkus会等待60秒的时间来启动原生镜像，然后本地测试自动失败。这个持续时间可以使用 `quarkus.test.wait-time` 系统属性来改变。例如，要增加持续时间到300秒，使用： `./mvnw verify -Pnative -Dquarkus.test.wait-time=300` 。

source: By default, `KeycloakTestResourceLifecycleManager` uses HTTPS to initialize a Keycloak instance which can be disabled with `keycloak.use.https=false`. Default realm name is `quarkus` and client id - `quarkus-service-app` - set `keycloak.realm` and `keycloak.service.client` system properties to customize the values if needed.
zh_cn: 默认情况下， `KeycloakTestResourceLifecycleManager` 使用HTTPS来初始化Keycloak实例，可以用 `keycloak.use.https=false` 来禁用。默认的领域(realm)名称是 `quarkus` ，客户端ID - `quarkus-service-app` - 如果需要，可以设置 `keycloak.realm` 和 `keycloak.service.client` 系统属性来定制数值。

source: By default, `quarkus.http.root-path` is prepended automatically to configured permission paths then do not use a forward slash, for example:
zh_cn: 默认情况下， `quarkus.http.root-path` 会自动被加在配置的权限路径之前并且不需要指定一个前置的斜杠，例如：

source: By default, a channel can be linked to a single consumer, using `@Incoming` method or `@Channel` reactive stream. At application startup, channels are verified to form a chain of consumers and producers with single consumer and producer. You can override this behavior by setting `mp.messaging.$channel.broadcast=true` on a channel.
zh_cn: 默认情况下，一个channel可以关联到一个单一的消费者上，通过使用 `@Incoming` 方法或 `@Channel` 响应式应式流。在程序启动时，channels 会被验证，以形成一个由单个消费者和生产者组成的消费者和生产者链。您可以通过在channel上设置 `mp.messaging.$channel.broadcast=true` 来覆盖这种行为。

source: By default, applications using the `quarkus-oidc` extension are marked as a `service` type application (see `quarkus.oidc.application-type`). This extension also supports only `web-app` type applications but only if the access token returned as part of the authorization code grant response is marked as a source of roles: `quarkus.oidc.roles.source=accesstoken` (`web-app` type applications check ID token roles by default).
zh_cn: 默认情况下，使用 `quarkus-oidc` 扩展的应用程序被标记为 `service` 类型的应用程序（见 `quarkus.oidc.application-type` ）。这个扩展也仅支持 `web-app` 类型的应用程序且只有当作为授权码授予响应的一部分而返回的访问token被标记为角色的来源时可行： `quarkus.oidc.roles.source=accesstoken` （ `web-app` 类型的应用程序会默认检查ID token角色）。

source: By default, incoming methods receive each Kafka record individually. Under the hood, Kafka consumer clients poll the broker constantly and receive records in batches, presented inside the `ConsumerRecords` container.
zh_cn: 默认情况下，接收方法会单独接收每条Kafka记录。在后台，Kafka消费者client会不断地轮询broker，并批量接收记录然后放入 `ConsumerRecords` 容器中。

source: By default, integration tests both *build* and *run* the native executable using the `prod` profile.
zh_cn: 集成测试默认使用 `prod` 的配置（profile） *构建* 并 *运行* 原生可执行文件。

source: By default, native tests runs using the `prod` profile. This can be overridden using the `quarkus.test.native-image-profile` property. For example, in your `application.properties` file, add: `quarkus.test.native-image-profile=test`. Alternatively, you can run your tests with: `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test`. However, don't forget that when the native executable is built the `prod` profile is enabled. So, the profile you enable this way must be compatible with the produced executable.
zh_cn: 默认情况下，原生测试使用 `prod` 配置文件运行。这可以用 `quarkus.test.native-image-profile` 属性来覆盖。例如，在你的 `application.properties` 文件中，添加： `quarkus.test.native-image-profile=test` 。或者，你可以用以下方式运行你的测试。 `./mvnw verify -Pnative -Dquarkus.test.native-image-profile=test` 。然而，不要忘记当原生可执行文件被构建时， `prod` 配置文件被启用。因此，你通过这种方式启用的配置文件必须与生成的可执行文件兼容。

source: By default, tests should just work with xref:dev-services.adoc[Dev Services], however from some use cases you may need access to the automatically configured properties in your tests.
zh_cn: 默认情况下，测试应该只与 link:dev-services.html[开发服务] 一起工作，然而在一些用例中，您可能需要访问测试中自动配置的属性。

source: By default, tests will run on port `8081` so as not to conflict with the running application. We automatically configure RestAssured to use this port. If you want to use a different client you should use the `@TestHTTPResource` annotation to directly inject the URL of the tested application into a field on the test class. This field can be of the type `String`, `URL` or `URI`. This annotation can also be given a value for the test path. For example, if I want to test a Servlet mapped to `/myservlet` I would just add the following to my test:
zh_cn: 默认情况下，测试将在端口 `8081` 上运行，以便不与正在运行的应用程序冲突。我们自动将RestAssured配置为使用该端口。如果你想使用不同的客户端，你应该使用 `@TestHTTPResource` 注释，直接将测试应用程序的URL注入到测试类的一个字段中。这个字段的类型可以是 `String` , `URL` 或 `URI` 。这个注解也可以给测试路径一个值。例如，如果我想测试一个映射到 `/myservlet` 的Servlet，只需在测试中添加以下内容：

source: By default, the OpenTelemetry extension enables the https://www.w3.org/TR/trace-context/[W3C Trace Context] and the https://www.w3.org/TR/baggage/[W3C Baggage] propagators, you can however choose any of the supported OpenTelemetry propagators by setting the `propagators` config that is described in the <<configuration-reference>>.
zh_cn: 默认情况下，OpenTelemetry扩展启用了 link:https://www.w3.org/TR/trace-context/[W3C Trace Context] 和 link:https://www.w3.org/TR/baggage/[W3C Baggage] propagators，但是您可以通过设置 link:#configuration-reference[[参考配置]] 中描述的 `propagators` 配置来选择任何支持的OpenTelemetry propagators。

source: By default, the Reactive Messaging `Message` is acknowledged when the broker acknowledged the message. When using routers, this acknowledgement may not be enabled. In this case, configure the `auto-acknowledgement` attribute to acknowledge the message as soon as it has been sent to the router.
zh_cn: 默认情况下，当代理确认消息时，响应式消息 `Message` 也会被确认。当使用路由器时，这种确认可能不会被启用。在这种情况下，配置 `auto-acknowledgement` 属性，以便在消息被发送到路由器后立即确认。

source: By default, the Red Panda broker does not act as a transaction coordinator. To enable transactions, set:
zh_cn: 默认情况下，Red Panda broker不会作为一个事务协调器来运行。如果想启用事务，请设置：

source: By default, the `@InjectMock` annotation can be used for any normal CDI scoped bean (e.g. `@ApplicationScoped`, `@RequestScoped`). Mocking `@Singleton` beans can be performed by setting the `convertScopes` property to true (such as `@InjectMock(convertScopes = true`). This will convert the `@Singleton` bean to an `@ApplicationScoped` bean for the test.
zh_cn: 默认情况下， `@InjectMock` 注解可用于任何正常的CDI scoped的Bean（例如 `@ApplicationScoped` , `@RequestScoped` ）。如果要mock `@Singleton` Bean则可以通过设置 `convertScopes` 属性为true来达到目的（如 `@InjectMock(convertScopes = true)` ）。这会把 `@Singleton` bean转换为 `@ApplicationScoped` bean来测试。

source: By default, the `JsonbSerializer` serializes null as the `"null"` String, this can be customized by setting the Kafka configuration property `json.serialize.null-as-null=true` which will serialize null as `null`. This is handy when using a compacted topic, as `null` is used as a tombstone to know which messages delete during compaction phase.
zh_cn: 默认情况下， `JsonbSerializer` 将null序列化为 `"null"` 字符串，这可以通过设置Kafka配置属性 `json.serialize.null-as-null=true` 来将null序列化为 `null` 。这在使用压缩的topic时很方便，因为 `null` 被用作标记来表示在压缩阶段哪些消息被删除了。

source: By default, the `ObjectMapperSerializer` serializes null as the `"null"` String, this can be customized by setting the Kafka configuration property `json.serialize.null-as-null=true` which will serialize null as `null`. This is handy when using a compacted topic, as `null` is used as a tombstone to know which messages delete during compaction phase.
zh_cn: 默认情况下， `ObjectMapperSerializer` 将null序列化为 `"null"` 字符串，这可以通过设置Kafka配置属性 `json.serialize.null-as-null=true` ，将null序列化为 `null` 。这在使用压缩的topic时很方便，因为 `null` 被用作标记来表示在压缩阶段哪些消息被删除了。

source: By default, the `iss` claim value is compared to the `issuer` property which may have been discovered in the well-known provider configuration. But if `quarkus.oidc.token.issuer` property is set then the `iss` claim value is compared to it instead.
zh_cn: 默认情况下， `iss` 声明的值会与 `issuer` 属性进行比较，该属性有可能会在众所周知的提供者配置中找到。但是，如果 `quarkus.oidc.token.issuer` 属性被设置，那么 `iss` 声明的值将与它进行比较。

source: By default, the code consuming the event must be _non-blocking_, as it's called on an I/O thread. If your processing is blocking, use the `@io.smallrye.common.annotation.Blocking` annotation:
zh_cn: 默认情况下，消费该事件的代码必须是 _非阻塞的_ ，因为它是在一个I/O线程上调用的。如果你的处理是阻塞的，请使用 `@io.smallrye.common.annotation.Blocking` 注解。

source: By default, the connector does wait for Kafka to acknowledge the record to continue the processing (acknowledging the received Message). You can disable this by setting the `waitForWriteCompletion` attribute to `false`.
zh_cn: 默认情况下，connector会等待Kafka确认记录以继续处理(确认收到的消息)。您可以通过将 `waitForWriteCompletion` 设置为 `false` 来禁用这个功能。

source: By default, the extension is going to fetch resources on-demand from Keycloak where their `URI` are used to map the resources in your application that should be protected.
zh_cn: 默认情况下，扩展将从Keycloak按需获取资源，而资源 `URI` 被用于映射您的应用程序中应被保护的资源。

source: By default, the topic name is same as the channel name. You can configure the topic attribute to override it.
zh_cn: 默认情况下，topic名称与channel名称相同。您可以配置topic属性来覆盖它。
